-- phpMyAdmin SQL Dump
-- version 5.0.0-dev
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2019 年 06 月 13 日 22:40
-- 伺服器版本： 5.5.45
-- PHP 版本： 7.1.19

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `phpproject`
--

-- --------------------------------------------------------

--
-- 資料表結構 `activity`
--

CREATE TABLE `activity` (
  `id` int(4) NOT NULL,
  `category` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `num` int(25) NOT NULL,
  `borrownumber` int(4) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `activity`
--

INSERT INTO `activity` (`id`, `category`, `name`, `num`, `borrownumber`) VALUES
(1, '籃球', '籃球-比賽用.男', 500, 611),
(2, '籃球', '籃球-比賽用.女', 500, 426),
(3, '籃球', '籃球背心', 500, 960),
(4, '籃球', '籃球-上課用.男', 500, 1215),
(5, '籃球', '籃球-上課用.女', 500, 959),
(6, '籃球', '籃球犯規紀錄組', 500, 774),
(7, '籃球', '籃球多功能電子計時器', 500, 1384),
(8, '籃球', '籃球24秒新款數位計時器及著地式組架', 500, 489),
(9, '籃球', '籃網', 500, 1112),
(10, '排球', '排球-比賽用', 500, 308),
(11, '排球', '排球-上課用', 500, 1158),
(12, '桌球', '桌球圍布架', 500, 599),
(13, '桌球', '桌球正拍-上課用', 500, 685),
(14, '桌球', '桌球刀拍-上課用', 500, 942),
(15, '桌球', '桌球-上課用', 500, 904),
(16, '桌球', '桌球記分板(其他球類可用)', 500, 498),
(17, '桌球', '桌球集球網', 500, 287),
(18, '羽球', '羽球-上課用', 500, 508),
(19, '羽球', '羽球拍-上課用', 500, 606),
(20, '壘球', '壘球-上課用', 500, 968),
(21, '壘球', '壘球-軟式', 2000, 425),
(22, '壘球', '壘球手套-捕手', 300, 1083),
(23, '壘球', '壘球棒-上課用-鋁棒', 8000, 1103),
(24, '壘球', '壘球棒-上課用-木棒', 8000, 1454),
(25, '壘球', '壘包-上課用(三片+一片/組)', 1000, 384),
(26, '壘球', '壘球頭盔', 500, 713),
(27, '壘球', '壘球手套-上課右投用', 500, 1386),
(28, '壘球', '壘球手套-上課左投用', 500, 311),
(29, '壘球', '打擊練習器組', 3000, 525),
(30, '木球', '木球-上課用', 600, 1491),
(31, '木球', '標示盤(四色一組/40片)', 700, 1467),
(32, '木球', '木球桿-上課用-鋁合金-自信藍', 500, 941),
(33, '木球', '木球桿-上課用-鋁合金-黃', 500, 1458),
(34, '木球', '木球桿-上課用-木頭', 600, 1366),
(35, '木球', '木球門-上課用-木質', 900, 1237),
(36, '網球', '網球-上課用-軟式', 800, 1061),
(37, '網球', '網球-上課用', 1000, 1466),
(38, '網球', '網球-教練推車-黑', 1, 1370),
(39, '網球', '網球推車-藍', 1, 605),
(40, '網球', '網球拍-上課用', 673, 608),
(41, '網球', '網球裁判椅', 3, 915),
(42, '網球', '網球網', 964, 456),
(43, '游泳', '體育課訓練用短蛙鞋-L', 3628, 217),
(44, '游泳', '體育課訓練用短蛙鞋-M', 6374, 507),
(45, '游泳', '體育課浮板(45*30*4)', 6541, 283),
(46, '游泳', '划水板(黃8字)', 9871, 1195),
(47, '游泳', '訓練用划手板-黑', 6548, 1340),
(48, '游泳', '兩用浮板-黃', 457, 903),
(49, '游泳', '魚雷浮標-紅', 6841, 523),
(50, '游泳', '魚雷浮標-橘', 5471, 267),
(51, '足球', '足球-上課用#5', 8441, 743),
(52, '足球', '足球-上課用#4', 5678, 918),
(53, '足球', '足球-比賽用', 1244, 380),
(54, '棒球', '棒球鋁棒', 5441, 814),
(55, '棒球', '棒球頭盔', 4811, 942),
(56, '棒球', '樂樂棒球-上課', 1477, 753),
(57, '測量-體適能', '仰臥起坐墊-紅', 888, 273),
(58, '測量-體適能', '碼表-百組計時', 55, 1326),
(59, '測量-體適能', '碼表-單組計時', 66, 1020),
(60, '測量-體適能', '皮尺100M', 669, 660),
(61, '測量-體適能', '體前彎測量器', 399, 1424),
(62, '測量-體適能', '測距輪', 333, 487),
(63, '容器', '圓形球籃大', 55, 299),
(64, '容器', '圓形球籃小', 44, 668),
(65, '容器', '棒/壘球袋', 666, 356),
(66, '田徑用品', '接力棒', 666, 506),
(67, '田徑用品', '鐵扒', 99, 1137),
(68, '啦啦隊', '力波龍墊', 777, 563),
(69, '啦啦隊', '加油棒-紅', 500, 512),
(70, '啦啦隊', '加油棒-藍', 666, 514),
(71, '啦啦隊', '加油棒-黃', 314, 501),
(72, '啦啦隊', '加油棒-綠', 552, 1424),
(73, '啦啦隊', '加油棒-白', 765, 266),
(74, '啦啦隊', '加油棒-橘', 469, 1119),
(75, '其它', '系牌-木製', 500, 1060),
(76, '其它', '系牌-壓克力', 500, 253),
(77, '其它', '抗力球', 500, 412),
(78, '其它', '旗套', 500, 762),
(79, '其它', '呼拉圈', 500, 1347),
(80, '其它', '跳繩', 500, 1408),
(81, '其它', '飛盤', 500, 525),
(82, '其它', '三角錐-中', 400, 788),
(83, '其它', '三角錐-小', 231, 1217),
(84, '其它', '多用途記分板', 546, 1348),
(85, '其它', '2輪劃線器', 2121, 612),
(86, '其它', '無線對講機', 2123, 1010),
(87, '鑰匙', '壁球室鑰匙', 500, 1225),
(88, '鑰匙', '體適能教室鑰匙', 2121, 528),
(89, '鑰匙', '洪四川運動廣場門、廁所鑰匙', 454, 1109),
(90, '鑰匙', '洪四川運動廣場機房鑰匙', 1, 1081),
(91, '鑰匙', '洪四川運動廣場貴賓室鑰匙', 1, 1207),
(92, '鑰匙', '羽球場門鑰匙', 1, 978),
(93, '鑰匙', '羽球場機房(燈)鑰匙', 1, 615),
(94, '鑰匙', '桌球室機房(燈)鑰匙', 1, 230),
(95, '鑰匙', '網球場門鑰匙', 1, 1322),
(96, '鑰匙', '理工籃球燈開關箱鑰匙', 1, 677),
(97, '鑰匙', '排球場燈箱開關鑰匙', 1, 570),
(98, '鑰匙', '壘球場灑水開關箱鑰匙', 1, 1455),
(99, '鑰匙', '壘球場燈開關箱鑰匙', 1, 569),
(100, '鑰匙', '綜合籃球場燈開關鑰匙', 1, 1295),
(101, '鑰匙', '田徑場器材間門鑰匙', 1, 1087),
(102, '鑰匙', '壘球場休息區燈箱鑰匙', 1, 660),
(103, '鑰匙', '洪四川男廁置物間', 1, 741),
(104, '工具', '活動扳手', 500, 821),
(105, '工具', '看台用T扳手', 23, 450),
(106, '工具', '看臺用扳手', 45, 728),
(107, '工具', '地墊架用扳手', 45, 985),
(108, '工具', '排球柱用扳手', 45, 1100),
(109, '工具', '螺絲起子(十字)', 45, 1193),
(110, '工具', '鋤頭', 45, 751),
(111, '工具', '鋁梯(9尺)', 43, 951),
(112, '工具', '推水器', 12, 795),
(113, '校隊-棒球類', '球棒-ZETT', 300, 1460),
(114, '校隊-棒球類', '置球籃藍色', 12, 488),
(115, '校隊-木球類', '木球桿-鋁合金(土、黑藍、蘋綠、鳳紅)', 50, 464),
(116, '校隊-木球類', '木球門-鋁合金', 50, 966),
(117, '校隊-木球類', '木球-校隊等級', 500, 763),
(118, '校隊-木球類', '球道線', 50, 437),
(119, '校隊-木球類', '木球道號碼標示牌', 323, 851),
(120, '校隊-木球類', '橡膠墊-鋁合金球桿替換用', 545, 1204),
(121, '校隊-木球類', '木球球袋', 13, 459),
(122, '校隊-木球類', '木球門用-橡膠槌', 456, 590),
(123, '跆拳', '踢靶', 200, 1414),
(124, '跆拳', '速度靶', 232, 1058),
(125, '跆拳', '護胸', 454, 660),
(126, '跆拳', '護頭', 313, 970);

-- --------------------------------------------------------

--
-- 資料表結構 `br`
--

CREATE TABLE `br` (
  `ID` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `cl` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `num` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `YN` varchar(20) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `br`
--

INSERT INTO `br` (`ID`, `cl`, `num`, `YN`) VALUES
('x948787', '力波龍墊', '2', 'N'),
('x948787', '加油棒-橘', '1', 'N'),
('x948787', '壁球拍-上課用', '6', 'N'),
('x948787', '壘球-上課用', '20', 'N'),
('x948787', '洪四川男廁置物間', '1', 'N');

-- --------------------------------------------------------

--
-- 資料表結構 `class`
--

CREATE TABLE `class` (
  `id` int(4) NOT NULL,
  `Category` varchar(10) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `Name` varchar(20) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `Number` int(5) DEFAULT NULL,
  `borrownumber` int(4) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `class`
--

INSERT INTO `class` (`id`, `Category`, `Name`, `Number`, `borrownumber`) VALUES
(1, '其它', '2輪劃線器', 500, 962),
(2, '其它', '4輪劃線器', 500, 1151),
(3, '其它', '三角錐-中', 500, 1358),
(4, '其它', '三角錐-小', 500, 247),
(5, '測量/體適能', '仰臥起坐墊(紅)', 500, 1207),
(6, '測量/體適能', '仰臥起坐墊(黑)', 500, 724),
(7, '游泳', '兩用浮板(黃)', 500, 1078),
(8, '工具', '冷氣遙控器', 500, 1237),
(9, '啦啦隊', '力波龍墊', 500, 1188),
(10, '其它', '呼拉圈', 500, 926),
(11, '容器', '圓形球籃-大', 500, 1285),
(12, '容器', '圓形球籃-小', 500, 808),
(13, '壁球', '壁球-比賽用', 500, 728),
(14, '鑰匙', '壁球室鑰匙', 500, 1483),
(15, '壁球', '壁球拍-上課用', 500, 1000),
(16, '壘球', '壘包-上課用(3片+1片/組)', 500, 1428),
(17, '壘球', '壘球-上課用', 500, 913),
(18, '壘球', '壘球-軟式', 500, 1302),
(19, '壘球', '壘球保護網', 500, 1320),
(20, '鑰匙', '壘球場休息區燈箱鑰匙', 500, 1141),
(21, '鑰匙', '壘球場燈開關箱鑰匙', 500, 1415),
(22, '壘球', '壘球手套-上課.右投用', 500, 675),
(23, '壘球', '壘球手套-上課.左投用', 500, 778),
(24, '壘球', '壘球手套-捕手', 500, 258),
(25, '壘球', '壘球棒-上課用-木棒', 500, 638),
(26, '壘球', '壘球棒-上課用-鋁棒', 500, 1495),
(27, '壘球', '壘球頭盔', 500, 1345),
(28, '其它', '多用途記分板', 500, 766),
(29, '容器', '大型四輪推車', 500, 1130),
(30, '田徑用品', '大隊接力背心-橘', 500, 1191),
(31, '田徑用品', '大隊接力背心-白', 500, 684),
(32, '田徑用品', '大隊接力背心-粉紅', 500, 629),
(33, '田徑用品', '大隊接力背心-紅', 500, 290),
(34, '田徑用品', '大隊接力背心-綠', 500, 1010),
(35, '田徑用品', '大隊接力背心-藍', 500, 512),
(36, '田徑用品', '大隊接力背心-銀灰', 500, 736),
(37, '田徑用品', '大隊接力背心-黃', 500, 878),
(38, '容器', '小推車-則疊', 500, 1315),
(39, '容器', '小推車-置上下籃', 500, 393),
(40, '手球', '手球', 500, 723),
(41, '壘球', '打擊練習器組', 500, 938),
(42, '其它', '抗力球', 500, 979),
(43, '排球', '排球-上課用', 500, 596),
(44, '排球', '排球-比賽用', 500, 542),
(45, '田徑用品', '接力棒', 500, 806),
(46, '工具', '推水器', 500, 1087),
(47, '其它', '握力球', 500, 1383),
(48, '其它', '握把布', 500, 791),
(49, '其它', '握把布-厚', 500, 525),
(50, '游泳', '救生拋繩袋', 500, 1310),
(51, '游泳', '救生衣', 500, 688),
(52, '測量/體適能', '有氧韻律階梯(體適能檢測用)', 500, 1279),
(53, '木球', '木球-上課用', 500, 236),
(54, '校隊-木球類', '木球桿-校隊等級', 500, 310),
(55, '校隊-木球類', '木球桿-鋁合金', 500, 1167),
(56, '校隊-木球類', '木球桿-鋁合金(土、黑籃、蘋綠、鳳紅)', 500, 746),
(57, '校隊-木球類', '木球球袋', 500, 645),
(58, '校隊-木球類', '木球道號碼標示牌', 500, 527),
(59, '木球', '木球門-上課用-木質', 500, 994),
(60, '校隊-木球類', '木球門用橡膠槌', 500, 235),
(61, '桌球', '桌球-上課用', 500, 1462),
(62, '桌球', '桌球刀拍-上課用', 500, 1392),
(63, '桌球', '桌球圍布架', 500, 569),
(64, '鑰匙', '桌球室機房(燈)鑰匙', 500, 1083),
(65, '桌球', '桌球正拍-上課用', 500, 1312),
(66, '桌球', '桌球記分板(其他球類可用)', 500, 1362),
(67, '桌球', '桌球集球網', 500, 1462),
(68, '棒球', '棒球鋁棒', 500, 615),
(69, '棒球', '棒球頭盔', 500, 1397),
(70, '棒球', '樂樂棒球-上課', 500, 811),
(71, '木球', '標示盤(4色1組/40片)', 500, 725),
(72, '校隊-木球類', '橡膠墊-鋁合金球桿替換用', 500, 854),
(73, '游泳', '水上拉力繩', 500, 1394),
(74, '鑰匙', '洪四川男廁置物間-鑰匙', 500, 795),
(75, '鑰匙', '洪四川運動廣場機房鑰匙', 500, 1219),
(76, '鑰匙', '洪四川運動廣場貴賓室鑰匙', 500, 1281),
(77, '鑰匙', '洪四川運動廣場門、廁所鑰匙', 500, 293),
(78, '游泳', '浮潛蛙鞋', 500, 1123),
(79, '游泳', '浮球-腳夾板(8字型)', 500, 1441),
(80, '測量/體適能', '測距輪', 500, 1072),
(81, '校隊-木球類', '球道線', 500, 272),
(82, '測量/體適能', '瑜珈墊', 500, 478),
(83, '測量/體適能', '皮尺-100M', 500, 299),
(84, '測量/體適能', '碼表-單組計時', 500, 886),
(85, '測量/體適能', '碼表-百組計時', 500, 588),
(86, '測量/體適能', '立定跳遠墊', 500, 357),
(87, '籃球', '籃球-上課用.女', 500, 1422),
(88, '籃球', '籃球-上課用.男', 500, 520),
(89, '鑰匙', '綜合籃球場燈開關鑰匙', 500, 1467),
(90, '網球', '網球-上課用', 500, 1011),
(91, '鑰匙', '網球場門鑰匙', 500, 999),
(92, '網球', '網球拍-上課用', 500, 349),
(93, '校隊-棒球類', '置球籃-籃色', 500, 224),
(94, '羽球', '羽球-上課用', 500, 931),
(95, '羽球', '羽球-比賽用-羽毛', 500, 1451),
(96, '鑰匙', '羽球場機房(燈)鑰匙', 500, 1296),
(97, '鑰匙', '羽球場門鑰匙', 500, 1071),
(98, '羽球', '羽球拍-上課用', 500, 944),
(99, '游泳', '蛙鏡-比賽用', 500, 1133),
(100, '游泳', '蛙鞋', 500, 854),
(101, '游泳', '訓練用腳圈(紅)', 500, 1498),
(102, '木球', '課程用-1推車舍54支50球10門3槌', 500, 218),
(103, '跆拳', '護胸', 500, 1475),
(104, '跆拳', '護頭', 500, 1226),
(105, '足球', '足球-上課用-#4', 500, 581),
(106, '足球', '足球-上課用-#5', 500, 574),
(107, '足球', '足球-比賽用', 500, 1004),
(108, '其它', '跳繩', 500, 912),
(109, '跆拳', '踢靶', 500, 472),
(110, '跆拳', '速度靶', 500, 1235),
(111, '跆拳', '防禦靶', 500, 1405),
(112, '工具', '音響遙控器', 500, 470),
(113, '其它', '飛盤', 500, 940),
(114, '測量/體適能', '體前彎測量器', 500, 1250),
(115, '游泳', '體育課-浮板(45*30*4)', 500, 722),
(116, '游泳', '體育課-訓練用短蛙鞋-L', 500, 514),
(117, '游泳', '體育課-訓練用短蛙鞋-M', 500, 755),
(118, '游泳', '體育課-訓練用短蛙鞋-S', 500, 430),
(119, '游泳', '體育課-訓練用短蛙鞋-XL', 500, 265),
(120, '鑰匙', '體適能教室鑰匙', 500, 1227),
(121, '游泳', '魚雷浮標(橘)', 500, 1207),
(122, '游泳', '魚雷浮標(紅)', 500, 554);

-- --------------------------------------------------------

--
-- 資料表結構 `feedback`
--

CREATE TABLE `feedback` (
  `Name` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `Content` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `Date` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `feedback`
--

INSERT INTO `feedback` (`Name`, `Content`, `Date`) VALUES
('韓導', '高雄發大財', '2019-06-13'),
('王賤民', '我的球速太快，把球棒打斷35隻', '2019-06-13'),
('郭懂', '盤子好舔喔', '2019-06-13'),
('小英', '勞工是我心裡最軟的一塊', '2019-06-13'),
('陳隻漢', '幹爆韓幗瑜', '2019-06-13'),
('韓幗瑜', '我要捐3000億給你們買氣材', '2019-06-13'),
('迷之尼哥', '我資結過了，真爽', '2019-06-13'),
('陳侑均', '我最討厭楊O賢', '2019-06-13'),
('電商助教', '想吃天罰神雷嗎', '2019-06-13'),
('迷之尼哥', '我愛子賢', '2019-06-13'),
('迷之尼哥', '幹', '2019-06-13');

-- --------------------------------------------------------

--
-- 資料表結構 `fieldborrowed`
--

CREATE TABLE `fieldborrowed` (
  `ID` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `Name` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `place` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `fieldborrowed`
--

INSERT INTO `fieldborrowed` (`ID`, `Name`, `place`) VALUES
('x948787', '壁球', '壁球場(A)'),
('x948787', '排球', '排球場(1)'),
('x948787', '桌球', '桌球場(1)'),
('x948787', '田徑足球', '田徑場'),
('x948787', '體適能', '體適能教室'),
('x948787', '壁球', '壁球場(A)'),
('x948787', '桌球', '桌球場(1)'),
('x948787', '籃球', '洪四川運動廣場籃球場(2)'),
('x948787', '壁球', '壁球場(B)'),
('x948787', '籃球', '工院籃球場(A)'),
('x948787', '籃球', '綜合籃球場(丙)'),
('x948787', '壁球', '壁球場(A)'),
('x948787', '籃球', '工院籃球場(A)'),
('x948787', '排球', '排球場(1)'),
('x948787', '棒壘球', '棒壘球場'),
('x948787', '體適能', '體適能教室'),
('x948787', '網球', '網球場(C)'),
('x948787', '羽球', '羽球場(1)'),
('x948787', '桌球', '桌球場(1)'),
('x948787', '網球', '網球場(D)'),
('x948787', '壁球', '壁球場(A)'),
('x948787', '籃球', '工院籃球場(A)'),
('x948787', '排球', '排球場(1)'),
('x948787', '桌球', '桌球場(1)'),
('x948787', '棒壘球', '棒壘球場'),
('x948787', '田徑足球', '田徑場'),
('x948787', '網球', '網球場(A)'),
('x948787', '羽球', '羽球場(1)'),
('x948787', '排球', '排球場(3)'),
('x948787', '排球', '洪四川運動廣場排球場');

-- --------------------------------------------------------

--
-- 資料表結構 `notice`
--

CREATE TABLE `notice` (
  `browsenumber` int(10) NOT NULL,
  `date` text CHARACTER SET utf8 COLLATE utf8_unicode_ci,
  `title` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `content` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `num` int(4) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `notice`
--

INSERT INTO `notice` (`browsenumber`, `date`, `title`, `content`, `num`) VALUES
(1, '2019/04/26, 週五', '[休館公告] 5/1(三)適逢勞動節，泳池休館1日', '5/1(三)適逢勞動節，依規定游泳池救生員放假一天，基於安全考量，游泳池當天休館一天，健身房照常開放。\r\n\r\n不便之處敬請見諒！', 14131),
(2, '2019/06/03, 週一', '[休館公告] 6/7(五)適逢端午節，泳池休館1日', '6/7(五)適逢端午節，游泳池當天休館一天，健身房照常開放。\r\n\r\n不便之處敬請見諒！', 9795),
(3, '2018/09/12, 週三', '107學年度第1學期借場申請及繳費時間異動', '107學年度第1學期9月10日(星期一)起，運動場館申請(異動)及繳費時間如下：\r\n每週一、二、三、四下午 13:30-15:30。\r\n\r\n                                                                                                             07-5919490 體育室啟', 6852),
(4, '2018/11/01, 週四', '11月關館期間游泳池及健身房業務辦理時間及地點', '本校游泳池10月31日閉館，健身房開放時間為中午12點至晚上9點30分，每周一休館；申請辦卡地點改為體育室，辦理時間為每週一至每週五下午1點30分至晚上8點30分，歡迎各位師長多加利用。', 10563),
(5, '2019/05/18, 週六', '2019高大洪四川盃系際排球錦標賽成績', '男生組\r\n\r\n\r\n冠軍：電機學系\r\n\r\n亞軍：資訊工程學系\r\n\r\n季軍：運動健康與休閒學系\r\n\r\n殿軍：財/政法聯隊\r\n\r\n\r\n女生組：\r\n\r\n\r\n冠軍：化材西語聯隊\r\n\r\n亞軍：創意設計與建築學系\r\n\r\n季軍：應用數學系\r\n\r\n殿軍：亞太工商管理學系', 9449),
(6, '2018/09/12, 週三', '9/13-9/15洪四川運動廣場暫停借用', '洪四川運動廣場於 9月13 日至15日(星期四、五、六 )施作記分版安裝工程，\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n屆時場地暫停開放，如有不便，  請見諒。\r\n\r\n\r\n\r\n\r\n\r\n                                                                                                                                                  \r\n\r\n\r\n                                                                                                          07-5919490 體育室\r\n\r\n                                                                             ', 3806),
(7, '2018/12/16, 週日', '大專棒球聯賽公開組二級預賽，本校獲A組冠軍晉級複決賽！', '大專棒球聯賽公開組二級預賽，本校與大仁科大比賽再傳捷報，以三戰全勝晉級複決賽！', 10310),
(8, '2018/08/30, 週四', '恭賀本校校友 黃亭茵 榮獲2018年雅加達巨港亞運自由車全能賽銀牌', '賀！\r\n\r\n\r\n恭賀本校校友 黃亭茵 榮獲2018年雅加達巨港亞運自由車\r\n\r\n全能賽 銀牌 為校為國增光，全體師生仝賀。', 13035),
(9, '2018/12/14, 週五', '本校木球隊參加嘉義市107年諸羅山盃全國木球錦標賽成績', '球道團體賽：\r\n\r\n冠軍：許達榮、夏智玄冠軍亞軍：高瑞駿、李冠進，熊怡惠第五名：張介皇、賴政仁、吳怡臻、游念亭 社會組桿數賽：\r\n\r\n冠軍：張介皇第八名：李冠進第七名：吳怡臻第九名：熊怡惠', 8412),
(10, '2018/08/23, 週四', '游泳池健身房暫停開放乙次', '公    告\r\n\r\n因大豪雨積水致通行困難有致災之虞，高雄市政府宣布今天晚間(8/23)停班停課，\r\n\r\n故本校游泳池及健身房於16:30起關館。\r\n\r\n                                                                                                                       體育室   敬啟', 1279),
(11, '2018/08/16, 週四', '體育室校聘組員徵才結果公告', '體育室校聘組員徵才結果公告：\r\n\r\n校聘組員正取：鄭O榮先生\r\n\r\n校聘組員備取：邱O祺先生、李O嫻小姐。', 10194),
(12, '2018/08/15, 週三', '因本校年度電力檢修，游泳池及健身房電器設備暫停使用乙次', '公         告\r\n\r\n因配合本校年度電力設備定期維護與檢驗，游泳池及健身房107年08月19日（日）\r\n\r\n上午8點至中午12點所有電器設備暫停使用(如吹風機、照明設備、飲水機及熱水器等)\r\n\r\n，造成不便，敬請見諒!\r\n\r\n', 12562),
(13, '2018/06/22, 週五', '暑假借場公告', '公告\r\n\r\n\r\n一、107年7月1日起，暑假期間桌球室、羽球場、棒壘球場、洪四川運動廣場及網球場管制開放，除校隊暑訓使用時間外，其餘若需借用請於使用前7日至體育室繳交申請單並繳費。\r\n\r\n二、棒球校隊暑訓時間:   \r\n\r\n日期: 7/13、14、16、8/6(一)~9/12(三) 【不含六、日】時段: 08:00-17:00\r\n\r\n三、桌球、羽球校隊暑訓時間:\r\n\r\n日期: 8/20(一)~9/7(一)【不含六、日】，時段: 09:00-17:00\r\n\r\n四、7/2(一)~7/6(五)及9/10(一)~9/14(五) 08:00-17:00各球場開放使用，晚上18:00-22:00，若需使用請辦理租借。 \r\n\r\n                   體育室 啟(07-5919490)', 11172),
(14, '2018/06/22, 週五', '賀！本校參加107年教職員工木球錦標賽榮獲男子團體組亞軍', '賀！本校參加107年教職員工木球錦標賽榮獲　男子團體組　亞軍!', 8215),
(15, '2018/05/25, 週五', '107年身心障礙游泳C級裁判講習會', '社團法人臺中市身心障礙體育總會辦理「107年身心障礙\r\n游泳C級裁判講習會\r\n說明：\r\n一、活動時間：2018年6月23、24日(六、日)，上午八時至下\r\n午九時整。\r\n二、活動地點：豐原體育場(臺中市豐原區豐北街221號)\r\n三、採線上報名(https://goo.gl/dTzC9A )。', 3255),
(16, '2018/04/25, 週三', '國立高雄大學體育室校聘組員職缺甄選結果', '正取陳○雅小姐； \r\n備取第一順位蘇○維先生； \r\n備取第二順位林○雅小姐； \r\n（備取人員有效期限自公告翌日起3個月內有效。）', 4447),
(17, '2018/03/23, 週五', '男子100公尺進入決賽名單', '男子100公尺進入決賽名單 \r\n        姓名  系級 成績\r\n\r\n \r\n7094  胡勝清 資工系  12.04\r\n\r\n \r\n7087  黃楷鈞 電機系  12.31\r\n\r\n \r\n7090  馮冠傑 土環系  12.35\r\n\r\n \r\n7016  姚鈞佑 運健休  12.48\r\n\r\n \r\n7020  周秉毅 運技系  12.74\r\n\r\n \r\n7075  施宇睿 應化系  12.75\r\n\r\n \r\n7038  高銘謙 法律系  12.80\r\n\r\n \r\n\r\n 7092  邱裔豪 化材系  13.13', 1724),
(18, '2018/02/08, 週四', '室外排球場地施工，暫停開放借用', '公告\r\n    室外排球場地於107年2月9日(五)起，至2月27日(二)進行圍欄增高工程，施工期間暫停開放與借用。\r\n\r\n                  體育室啓\r\n                                                                       107年2月8日\r\n電話：07-5919490', 16909),
(19, '2018/01/25, 週四', '寒假運動場館使用公告', '公告\r\n一、 107年1月27日起，寒假期間桌球室、羽球場、棒壘球場、洪四川運動廣場及網球場管制開放，除校隊寒訓使用時間外，其餘若需借用請於使用前7日至體育室申請並繳費。\r\n棒球校隊寒訓時間:\r\n日期: 1/22(一)~2/9(五) 【不含六、日】時段: 09:00-17:00\r\n桌球、羽球校隊寒訓時間:\r\n日期: 1/22(一)~2/2(五) 【不含六、日】，時段: 09:00-17:00\r\n\r\n二、 1/22(一)~1/26(五)及2/21(三)~2/23(五)08:00-17:00各球場開放使用，\r\n18:00-22:00則需辦理租借。\r\n三、 棒球場於2/10、2/11、2/13、2/15、2/17、2/19無法外借。\r\n\r\n-以上公告若有未盡事宜，以體育室網站公告為主-  \r\n                                                        體育室洽詢電話:07-5919490  107年1月10日', 6827),
(20, '2017/11/22, 週三', '新生盃慢速壘球賽程成績公告', '冠軍:運動競技學系\r\n\r\n亞軍: 資訊管理學系\r\n\r\n季軍:應用數學系\r\n\r\n殿軍:土木與環境工程學系', 14022),
(21, '2017/10/25, 週三', '新生盃排球總成績', '新生盃排球成績\r\n\r\n冠軍:運動健康與休閒學系\r\n\r\n亞軍:資訊工程學系\r\n\r\n季軍:應用物理學系\r\n\r\n 殿軍:應用化學系\r\n', 8018),
(22, '2017/10/23, 週一', '2017高大運動嘉年華新生盃籃球錦標賽 名次', '2017高大運動嘉年華新生盃籃球錦標賽 於20日圓滿結束，恭喜以下得獎系級:\r\n\r\n男籃:\r\n\r\n冠軍 應用經濟學系\r\n\r\n亞軍 土木工程與環境工程學系\r\n\r\n季軍 電機工程學系\r\n\r\n殿軍 應用數學系\r\n\r\nMVP 應用經濟學系 陳仕穎\r\n\r\n女籃:\r\n\r\n冠軍 財經法律學系\r\n\r\n亞軍 運動健康與休閒學系\r\n\r\n季軍 生命科學系\r\n\r\n殿軍 東亞語文學系\r\n\r\nMVP 財經法律學系 黃雯琪', 16535),
(23, '2017/10/18, 週三', '新生盃桌球成績及名次', '新生盃桌球成績及名次\r\n\r\n冠軍 資訊管理學系\r\n\r\n亞軍 運動健康與休閒學系\r\n\r\n季 軍 電機工程學系 殿軍 土木與環境工程學系', 13289),
(24, '2017/10/02, 週一', '10月04日（星期三）適逢中秋節，當日整天休館, 游泳池及健身房暫停開館', '106年10月04日（星期三）適逢中秋節，當日整天休館, 游泳池及健身房暫停開館。造成不便，敬請見諒。                  體育室啟', 12063),
(25, '2017/09/27, 週三', '2017高大運動嘉年華競賽規程', '本室於10月16日(18:30)舉行2017高大運動嘉年華開幕典禮 ，各競賽項目辦理時間如下:          \r\n\r\n\r\n新生盃籃球錦標賽    10月16日至10月20日     \r\n\r\n\r\n新生盃桌球錦標賽    10月23日至10月26日     \r\n\r\n\r\n新生盃排球錦標賽    10月30日至11月03日     \r\n\r\n\r\n新生盃羽球錦標賽    11月20日至11月23日     \r\n\r\n\r\n系際盃慢速壘球錦標賽    11月27日至12月01日', 16833),
(26, '2017/09/25, 週一', '106年SSU特派員運動傳播研習會', '106年SSU特派員運動傳播研習會\r\n一、依 據：教育部體育署臺教體署學（三）字第1060008652號函辦理\r\n二、宗 旨：為培育大專校院運動賽會傳播人才，促進大專體育運動發展，歡迎有興趣參與大專體育賽事，並有意擔任「SSU大專學生運動網」SSU特派員之學生，參加本研習活動。\r\n三、指導單位：教育部體育署。\r\n四、主辦單位：中華民國大專院校體育總會（以下簡稱大專體總）。\r\n五、時間地點：中南區梯次—106年10月28日至29日，國家運動訓練中心教學大樓演講廳。 \r\n北區梯次—106年11月4日至5日，國立臺灣師範大學公館校區國際會議廳。\r\n六、研習內容：運動傳播相關課程。\r\n七、舉辦方式：上課內容以講授、互動、模擬為主要教學方式。\r\n八、研習師資：依各項課程邀請業界實際經驗人員參與。\r\n九、日 程 表：如附件一。 \r\n十、參加對象：大專院校不限科系之學生\r\n十一、參加梯次：中南區以100人為限，北區以120人為限，並依報名成功先後順序錄取參加。\r\n區域以就讀學校劃分，範圍如下：\r\n■北區梯次：台北、基隆、宜蘭、桃園、新竹、苗栗、花蓮、台東、金馬。\r\n■中南區梯次：台中、彰化、南投、雲林、嘉義、台南、高雄、屏東、澎湖。\r\n十二、報名資訊\r\n1、網路報名請至SSU大專學生運動網臉書專頁（www.facebook.com.tw/ctusfssu）\r\n或直接填寫google表單：\r\n中南區梯次—https://goo.gl/TcuQyp\r\n北區梯次—https://goo.gl/pXjRwx\r\n2、自即日起至10月13日（五），報名成功名單於10月16日（一）公佈在大專體總官網 （www.ctusf.org.tw） 與SSU大專學生運動網（http://www.ssu.org.tw），請密切注意。 \r\n3、報名費用：新台幣800元整，報名成功者當日於活動現場繳費（附午餐及筆記本）。\r\n4、洽詢電話：02-27710300#36 企宣組\r\n十三、備 註：\r\n（一）因故無法參加者請最遲於活動辦理前2日通知本會以利後續人員遞補。\r\n（二）研習會期間供應午餐，交通、住宿、個人意外保險請自理。\r\n（三）全程參與者，由大專體總頒發研習結業證書。\r\n（四）全程參與並通過遴選者將有機會入選SSU特派員。\r\n（五）研習會日程表與課程內容若有異動請以大專體總官網公告為準。', 19970),
(27, '2017/08/29, 週二', '「106年度教師體適能教學策略研習會」及「106年度學生暨家長體適能知能、態度暨身體活動研習營」', '「106年度教師體適能教學策略研習會」及「106年度學生暨家長體適能知能、態度暨身體活動研習營\r\n\r\n\r\n一、106年度教師體適能教學策略研習會資訊摘錄如下：\r\n(一)辦理時間及地點：\r\n１、臺南場次：106年10月21日（星期六）於國立臺南大學舉行。\r\n２、臺北場次：106年12月9日（星期六）於淡江大學舉行。\r\n(二)報名日期即日起至106年9月29日(星期五)下午5時止。\r\n(三)採用網路報名，請上體育署體適能網站最新消息報名。\r\n(四)優先錄取國小非體育專長老師，其次依報名先後順序錄取 ，錄取名單106年10月3日公告於體適能網站。\r\n二、106年度學生暨家長體適能知能、態度暨身體活動研習營資訊摘錄如下：\r\n(一)106年10月22日(星期日)於國立臺南大學啟明苑舉行。\r\n(二)參加對象為全國國民中小學家長及學生為主，預計錄取20 0人。\r\n(三)報名日期自即日起至106年9月29日(星期五)下午5時止。\r\n(四)採用網路報名，請上體育署體適能網站最新消息報名。\r\n(五)以國民中學家長優先錄取，其次依報名先後順序錄取，錄 取名單106年10月3日公告於體適能網站。\r\n三、請逕洽中華民國體育學會李筱苹小姐，聯絡電話：02-77346879。\r\n\r\n相關活動資訊請至:http://www.fitness.org.tw/msgdesc.php?id=551 查詢', 14952),
(28, '2017/08/29, 週二', '106年9月11日(一)起9月13日(三)止，桌球場暫不開放', '公告\r\n    桌球室電源佈設工程訂於106年9月11日(一)起施工至9月13日(三)止，屆時球場暫不開放，若有不便敬請見諒。', 11714),
(29, '2017/08/28, 週一', '泳池9月3日上午8點至中午12點所有電器設備暫停使用', '因配合本校年度電力設備定期維護與檢驗，游泳池及健身房106年09月03日（日）上午8點至中午12點所有電器設備暫停使用(如吹風機、照明設備、飲水機及熱水器等)，造成不便，敬請見諒!\r\n\r\n\r\n\r\n\r\n                                               體育室  啟', 7226),
(30, '2017/08/25, 週五', '「2017年秋季高雄全國常青田徑錦標賽」', '「2017年秋季高雄全國常青田徑錦標賽」比賽賽事資訊如下：\r\n(一)比賽時間：106年11月25日至26日。\r\n(二)比賽地點：高雄市中正運動場。\r\n(三)報名時間：即日起至106年10月30日上午12:00止。\r\n(四)連絡人：張灶生秘書長，電話：0933-505908。\r\n\r\n 詳請請至網站觀看:http://www.ctma.tw/', 10427),
(33, '2019/6/13，週四', '今日頭條', '恭喜小英打贏民進洞黨內初選民調\r\n小賴QQ(我剛看新聞的)', 2),
(34, '2019/6/13,週四', '尼哥資料庫', '當掉', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `place`
--

CREATE TABLE `place` (
  `id` int(4) NOT NULL,
  `Name` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `place` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `borrow` int(1) NOT NULL DEFAULT '1',
  `borrownumber` int(4) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `place`
--

INSERT INTO `place` (`id`, `Name`, `place`, `borrow`, `borrownumber`) VALUES
(1, '壁球', '壁球場(A)', 1, 18),
(2, '壁球', '壁球場(B)', 1, 9),
(3, '籃球', '工院籃球場(A)', 1, 382),
(4, '籃球', '工院籃球場(B)', 1, 273),
(5, '籃球', '工院籃球場(C)', 1, 207),
(6, '籃球', '工院籃球場(D)', 1, 143),
(7, '排球', '排球場(1)', 1, 842),
(8, '排球', '排球場(2)', 1, 763),
(9, '排球', '排球場(3)', 0, 675),
(10, '排球', '排球場(4)', 1, 591),
(11, '桌球', '桌球場(1)', 0, 744),
(12, '桌球', '桌球場(11)', 1, 342),
(13, '桌球', '桌球場(12)', 1, 294),
(14, '桌球', '桌球場(13)', 1, 213),
(15, '桌球', '桌球場(14)', 1, 140),
(16, '桌球', '桌球場(2)', 1, 691),
(17, '桌球', '桌球場(3)', 1, 671),
(18, '桌球', '桌球場(4)', 1, 637),
(19, '桌球', '桌球場(5)', 1, 584),
(20, '桌球', '桌球場(6)', 1, 520),
(21, '桌球', '桌球場(7)', 1, 453),
(22, '桌球', '桌球場(8)', 1, 399),
(23, '棒壘球', '棒壘球場', 0, 1010),
(24, '排球', '洪四川運動廣場排球場', 0, 1000),
(25, '籃球', '洪四川運動廣場籃球場(1)', 1, 946),
(26, '籃球', '洪四川運動廣場籃球場(2)', 1, 1237),
(27, '田徑足球', '田徑場', 0, 874),
(28, '籃球', '綜合籃球場(丁)', 1, 769),
(29, '籃球', '綜合籃球場(丙)', 1, 547),
(30, '籃球', '綜合籃球場(乙)', 1, 546),
(31, '籃球', '綜合籃球場(甲)', 1, 247),
(32, '網球', '網球場(A)', 0, 527),
(33, '網球', '網球場(B)', 1, 431),
(34, '網球', '網球場(C)', 1, 246),
(35, '網球', '網球場(D)', 1, 137),
(36, '網球', '網球場(E)', 1, 124),
(37, '網球', '網球場(F)', 1, 234),
(38, '羽球', '羽球場(1)', 0, 1360),
(39, '羽球', '羽球場(2)', 1, 1072),
(40, '羽球', '羽球場(3)', 1, 973),
(41, '羽球', '羽球場(4)', 1, 867),
(42, '羽球', '羽球場(5)', 1, 716),
(43, '田徑足球', '足球場', 1, 597),
(44, '體適能', '體適能教室', 1, 1000);

-- --------------------------------------------------------

--
-- 資料表結構 `student`
--

CREATE TABLE `student` (
  `id` int(4) NOT NULL,
  `Category` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  `Name` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `Number` int(5) DEFAULT NULL,
  `borrownumber` int(4) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `student`
--

INSERT INTO `student` (`id`, `Category`, `Name`, `Number`, `borrownumber`) VALUES
(1, '啦啦隊', '加油棒-橘', 700, 591),
(2, '啦啦隊', '加油棒-白', 700, 725),
(3, '啦啦隊', '加油棒-紅', 700, 1416),
(4, '啦啦隊', '加油棒-綠', 700, 907),
(5, '啦啦隊', '加油棒-藍', 700, 1139),
(6, '啦啦隊', '加油棒-黃', 700, 804),
(7, '其他', '呼拉圈', 750, 938),
(8, '容器', '圓形球籃-大', 200, 1419),
(9, '容器', '圓形球籃-小', 200, 654),
(10, '壁球', '壁球-比賽用', 850, 1343),
(11, '鑰匙', '壁球室鑰匙', 5, 487),
(12, '壁球', '壁球拍-上課用', 100, 621),
(13, '壘球', '壘球-上課用', 3000, 267),
(14, '壘球', '壘球-軟式', 3000, 749),
(15, '壘球', '壘球手套-上課.右投用', 250, 547),
(16, '壘球', '壘球手套-上課.左投用', 250, 1087),
(17, '壘球', '壘球頭盔', 128, 1412),
(18, '手球', '手球', 500, 720),
(19, '壘球', '打擊練習器組', 100, 313),
(20, '排球', '排球-上課用', 70, 1319),
(21, '木球', '木球-上課用', 787, 1305),
(22, '木球', '木球桿-上課用(木頭)', 150, 487),
(23, '木球', '木球門-上課用-木質', 327, 544),
(24, '桌球', '桌球-上課用', 999, 1276),
(25, '桌球', '桌球刀拍-上課用', 80, 207),
(26, '桌球', '桌球正拍-上課用', 80, 835),
(27, '棒球', '樂樂棒球-上課', 5000, 1457),
(28, '鑰匙', '洪四川男廁置物間-鑰匙', 5, 1392),
(29, '測量/體適能', '碼表-單組計時', 70, 1375),
(30, '測量/體適能', '立定跳遠墊', 300, 1147),
(31, '籃球', '籃球-上課用.女', 87, 1257),
(32, '籃球', '籃球-上課用.男', 87, 668),
(33, '網球', '網球-上課用', 600, 734),
(34, '網球', '網球拍-上課用', 300, 997),
(35, '羽球', '羽球-上課用', 9527, 1077),
(36, '羽球', '羽球拍-上課用', 250, 1006),
(37, '足球', '足球-上課用-#4', 3000, 358),
(38, '足球', '足球-上課用-#5', 3000, 1353),
(39, '其他', '飛盤', 4000, 1440),
(40, '游泳', '體育課-浮板(45*30*4)', 750, 771);

-- --------------------------------------------------------

--
-- 資料表結構 `user`
--

CREATE TABLE `user` (
  `ID` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `PASS` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `Name` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `st` varchar(25) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `user`
--

INSERT INTO `user` (`ID`, `PASS`, `Name`, `st`) VALUES
('x1234', 'x12345', '施勃宇', 'T'),
('x948787', 'xx9527', '施伯語', 'S');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `activity`
--
ALTER TABLE `activity`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `br`
--
ALTER TABLE `br`
  ADD PRIMARY KEY (`ID`,`cl`);

--
-- 資料表索引 `class`
--
ALTER TABLE `class`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `notice`
--
ALTER TABLE `notice`
  ADD PRIMARY KEY (`browsenumber`);

--
-- 資料表索引 `place`
--
ALTER TABLE `place`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `student`
--
ALTER TABLE `student`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`ID`);

--
-- 在傾印的資料表使用自動增長(AUTO_INCREMENT)
--

--
-- 使用資料表自動增長(AUTO_INCREMENT) `activity`
--
ALTER TABLE `activity`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=127;

--
-- 使用資料表自動增長(AUTO_INCREMENT) `class`
--
ALTER TABLE `class`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=123;

--
-- 使用資料表自動增長(AUTO_INCREMENT) `notice`
--
ALTER TABLE `notice`
  MODIFY `browsenumber` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;

--
-- 使用資料表自動增長(AUTO_INCREMENT) `place`
--
ALTER TABLE `place`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=45;

--
-- 使用資料表自動增長(AUTO_INCREMENT) `student`
--
ALTER TABLE `student`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
